app/Http/Controllers/Auth/RegisteredUserController.php

    public function create()
    {
        $subjects = Subjects::all();
---
select * from `subjects`